publish/something-about-cookie.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>关于 Cookie 的一些知识</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">关于 Cookie 的一些知识</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfa891b4">作用</a></li>
<li><a href="#orgcac693c">创建</a></li>
<li><a href="#org52605cc">属性</a></li>
<li><a href="#org73e2fce">withCredentials</a></li>
<li><a href="#orga349024">参考</a></li>
</ul>
</div>
</div>
<p>
Cookie 是服务器发送给客户端的一小段数据（一般不超过 4K）。客户端会在
请求时将 cookie 发送给服务器。由于 HTTP 是无状态的，服务器不会记住客户
端，因此就通过 cookie 的字段去辨识客户端。
</p>

<div id="outline-container-orgfa891b4" class="outline-2">
<h2 id="orgfa891b4">作用</h2>
<div class="outline-text-2" id="text-orgfa891b4">
<ul class="org-ul">
<li>管理会话信息： 例如登录信息，购物车，游戏分数等服务器需要记住的东西</li>
<li>个性化： 例如一些用户配置，主题等</li>
<li>跟踪： 通过 cookie 记录和分析用户行为</li>
</ul>
</div>
</div>

<div id="outline-container-orgcac693c" class="outline-2">
<h2 id="orgcac693c">创建</h2>
<div class="outline-text-2" id="text-orgcac693c">
<p>
当服务器收到请求时，可以通过返回一个或多个 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie">Set-Cookie</a> 头部字段设置
cookie。
</p>

<pre class="example" id="org63ddf5e">
Set-Cookie: id=a3fWa; Expires=Wed, 21 Oct 2015 07:28:00 GMT; Max-Age=2592000; Domain=somecompany.co.uk
</pre>

<p>
而客户端收到返回时，则会将信息存到 cookie 中，之后请求时，通过
<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cookie">Cookie</a> 头部传给服务器。
</p>

<pre class="example" id="org2b840ca">
Cookie: PHPSESSID=298zf09hf012fh2; csrftoken=u32t4o3tb3gg43; _gat=1
</pre>
</div>
</div>

<div id="outline-container-org52605cc" class="outline-2">
<h2 id="org52605cc">属性</h2>
<div class="outline-text-2" id="text-org52605cc">
<ul class="org-ul">
<li><b>Expires</b>: cookie 过期的绝对时间，相对于客户端的时间而言</li>
<li><b>Max-Age</b>: cookie 过期的相对时间</li>
<li>Expires 和 Max-Age 都不设置，则当关闭会话时，cookie 失效</li>
<li><b>Secure</b>: 只通过 HTTPS 传递 cookie</li>
<li><b>HttpOnly</b>: 不允许通过 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Document/cookie">Document.cookie</a> 获取 cookie，客户端就无法获取
了</li>
<li><b>Domian</b>: 指定可以接收 cookie 的主机，默认和设置 cookie 的主机一样，
不包含子域。如果设置了 Domain，则子域都是允许访问的。如果子域需要
共享 cookie，可以设置。</li>
<li><b>Path</b>: 需要包含 path 才能发送 cookie</li>
<li><b><a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite">SameSite</a></b>: 用来限制第三方的 cookie，指定跨站时如何发送
<ul class="org-ul">
<li>同站： 顶级域名 + 1 层域名都相同，例如 a.hello.com 和 b.hello.com
属于同站，应为顶级域名(.com) + 1 层域名(.hello) 都相同</li>
<li>跨站： 非同站就是跨站，例如： a.hi.com &amp; a.hello.com</li>
<li>第一方 cookie： 由地址栏的域名设置的 cookie</li>
<li>第三方 cookie： 和地址栏不同的域名所设置的 cookie</li>
<li>SameSite: Strict: 跨站时，任何情况都不发送 cookie</li>
<li>SameSite: Lax (默认): 大多数跨站都不发送 cookie，除了链接(a 标签)，预加载，
get表单</li>
<li>SameSite: None: 不管是否跨站都发送，但是同时要设置 Secure 属性才行, 也意味
着网站需要支持 https</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org73e2fce" class="outline-2">
<h2 id="org73e2fce">withCredentials</h2>
<div class="outline-text-2" id="text-org73e2fce">
<p>
当跨站或者跨域发送请求时，想要带上 cookie，就得设置 <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequest/withCredentials">withCredentials</a>
为 true，同时服务器要返回 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Access-Control-Allow-Credentials">Access-Control-Allow-Credentials</a>，也设置为
true，<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Access-Control-Allow-Origin">Access-Control-Allow-Origin</a> 不能设置为 *，得指定对应的请求的
origin。
</p>

<blockquote>
<p>
For requests without credentials, the literal value "*" can be specified as a wildcard
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orga349024" class="outline-2">
<h2 id="orga349024">参考</h2>
<div class="outline-text-2" id="text-orga349024">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies">Cookie</a> - MDN</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie">Set-Cookie</a> - MDN</li>
<li><a href="https://www.ruanyifeng.com/blog/2019/09/cookie-samesite.html">Cookie 的 SameSite 属性</a> - ruanyifeng</li>
<li><a href="https://zhuanlan.zhihu.com/p/121048298">SameSite小识</a> - 知乎@深红</li>
<li><a href="https://zhuanlan.zhihu.com/p/34591096">你是如何被广告跟踪的？</a> -知乎@巴伐利亚啤酒馆</li>
<li><a href="https://alexzhong22c.github.io/2020/05/22/cross-origin-cross-site/">01-跨域和跨站的基本概念</a> @Alex Zhong</li>
<li><a href="https://web.dev/same-site-same-origin/">Understanding "same-site" and "same-origin"</a> - web.dev@Eiji Kitamura</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2022-02-23 Wed 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
